[
{"title": ["13 Blogging Mistakes Most Beginner Bloggers Make"], "paragraph": ["Sometimes, when I tell people that I blog for a living, they roll their eyes. \"That's so easy,\" they say. \"You get a paycheck for sitting on the internet all day and writing. A monkey could do your job!\"", "That's when", " roll my eyes. See, people are quick to deem blogging as a no-brainer job. But when they actually sit down to write their first couple of posts, it hits them: ", ".", " Like any person starting a new job, they mess things up.", "That's okay -- it happens to pretty much every new blogger. Luckily, it's pretty easy to avoid these roadblocks if you know they're coming.", "So for all of you beginner bloggers out there who are looking to get up-to-speed quickly, keep on reading. Below are 12 common mistakes most beginners make and some tips on how to avoid them.", "Simply put, a blog is a tool that can help develop an online presence, attract leads, and engage with an audience. It's often a series of editorial content centered around a central topic that demonstrates industry expertise -- for instance, a catering company might write blog posts like \"The 11 Best Appetizers to Serve to a Crowd\" or \"Stress-Free Dinner Parties: Recipes that are Prepared Ahead of Time\".", "Blogs can help drive traffic to your website, convert that traffic into leads, establish authority in your industry, and ", ". In fact, organizations are ", " by prioritizing blogging. ", "Most of a blog's traffic is driven organically -- in other words, consumers will search for something on a search engine and click on your blog if it matches their intended topic. However, there are a lot of organizations competing for your audience's attention, so it's important to avoid common blog mistakes to stand out.  ", "As much as you might read and re-read your blog posts after you publish them, you're not the only reader, or the intended reader.", "When you start blogging, ideas will come to you at random times -- in the shower, on a run, while on the phone with your mom. While the ideas may come at random moments, the ideas themselves should never be random. Just because it's a good idea in general -- or something that interests you personally -- doesn't mean it's a good idea for your company.", "The reason you're blogging is to solve problems for your audience and, ultimately, to grow your business. So, all of your blog post ideas should ", ". They should have natural tie-ins to issues in your industry and address specific questions and concerns your prospects have.", "Need help figuring out what those goals are and how to address them? Chat with your manager about the larger company goals, and then ", " with someone on the sales team to hear what questions they get asked most often. After both meetings, you should know which goals you need to achieve and have some ideas on how to achieve them.", "Writing a blog post is much different than writing a term paper. But when bloggers first start out, they usually only have experience with the latter. The problem? The style of writing from a term paper is ", " the style of writing people enjoy reading.", "Let's be honest: Most of the people who see your post aren't going to read the whole thing. If you want to keep them interested, you have to compel them to keep reading by ", ".", "It's okay to be more conversational in your writing -- in fact, we encourage it. The ", ", the more people will enjoy reading it. People want to feel like they're doing business with real people, not robots.", "So loosen up your writing. Throw in contractions. Get rid of the jargon. Make a pun or two. That's how real people talk -- and that's what real people like to read.", "It sounds harsh, but it's the truth: When people first start out blogging, they think that their audience will be inherently interested in ", "stories and ", " interests ... but that's not the case. It's no knock against them as a person -- it's just that when you're new, no one is interested in you and your experiences. People care way more about what you can teach them.", "Even though people don't really care that it's ", " that's writing the post, you can infuse parts of your personality in your writing to make them feel more comfortable with you. How you do that is entirely up to you. Some people like to crack jokes, some like to make pop culture references, and others have a way with vivid descriptions.", "HubSpot's Director of Content ", " is particularly good at this. Here's an example from the introduction ", ":", "To infuse personality into your own writing, try looking for ways to relate to your readers on the topic you're writing about -- then write in the first person as if you're hanging out with them and chatting about it. Make your tone personal, approachable, and engaging, just like you would in a face-to-face conversation.", "Although you are encouraged to let your own personality shine through in your writing, don't abuse the privilege. It's one thing to be yourself in the topic you're covering, but it's another thing to bring up too many personal experiences that bury the point you're trying to make.", "Don't digress into these personal anecdotes and analogies too much -- your readers aren't sitting in front of you, which means you can't guarantee that you have their undivided attention. They can (and will) bounce from your article if they lose patience. ", "To prevent your writing from losing its audience, restate your point in every section of the article. The best blog posts commit to an overarching message and then deliver it gradually, expressing it multiple times in small ways from beginning to end.", "If you're writing about how much water a potted plant needs, for example, don't spend three paragraphs telling a story of how you came home to a dead fern after returning from a two-week vacation. This story offers real evidence of your point, but what ", " your point? Certain plants can't go without water for more than 14 days. That's one possible point, and it should be stated upfront.", "When people start blogging, they generally want to write on really big topics like:", "Topics like these are far too broad. Because there are so many details and nuances in these topics, it's really hard to do a good job answering them. Plus, more specific topics tend to attract smaller, more targeted audiences, ", " and more likely to convert into leads and customers.", "So, to get the most short-term and long-term benefits of blogging, you'll need to get way more specific.", "Nailing really specific blog topics is crucial to knocking your first few posts out of the park. Let us help you brainstorm with our ", ". This tool allows you to enter basic terms you know you want to cover, and then produces five sample blog titles that work for business blogs.", "Keep in mind that a working title isn't final -- it's just a concrete angle you can use to keep your writing on track. Once you nail this stage of the ideation process, it's much easier to write your blog posts.", "Sometimes when I get a great idea I'm excited about, it's really tempting to just sit down and let it flow out of me. But what I get is usually a sub-par blog post.", "Why? The stream-of-consciousness style of writing isn't really a good style for blog posts. Most people are going to scan your blog posts, not read them, so it needs to be organized really well for that to happen.", "The first thing you should do is choose what ", "of blog post you're going to write. Is it a how-to post? A list-based post? A curated collection post? A SlideShare presentation? For help on this, ", "Once you have a template down, it'll be easier to write your outline.", "Writing an outline makes a big difference. If you put in the time up front to organize your thoughts and create a logical flow in your post, the rest becomes easy -- you're basically just filling in the blanks.", "To write a blog post outline, first come up with a list of the top takeaways you want your readers to get from your post. Then, break up those takeaways into larger section headers. When you put in a section header every few paragraphs, your blog post becomes easier and more enjoyable to read. (And plus, ", ".) When you finally get to writing, all you'll have to do is fill in those sections.", "Let's say I'm writing a blog post about why businesses should consider using Instagram for marketing. When I'm making that argument, which is more convincing?", "The second, of course. Arguments and claims are much more compelling when rooted in data and research. As marketers, we don’t just have to convince people to be on our side about an issue -- we need to convince them to ", " Data-driven content catches people's attention in a way that fluffy arguments do not.", "In any good story, you’ll offer a main argument, establish proof, and then end with a takeaway for the audience. You can ", " to introduce your main argument and show why it's relevant to your readers, or as proof of it throughout the body of the post.", "Some great places to find compelling data include:", "Plagiarism didn't work in school, and it certainly doesn't work on your company's blog. But for some reason, many beginner bloggers think they can get away with the old copy-and-paste technique.", "You can't. Editors and readers can usually tell when something's been copied from somewhere else. Your voice suddenly doesn't sound like you, or maybe there are a few words in there that are incorrectly used. It just sounds ... off.", "Plus, if you get caught ", ", you could get your site penalized by Google -- which could be a big blow to your company blog's organic growth.", "Instead, take a few minutes to ", ". It's not super complicated, but it's an essential thing to learn when you're first starting out.", "Most people make the mistake of not editing their writing. It sounded so fluid in their head when they were writing that it ", " be great to read ... right?", "Nope -- it still needs editing. And maybe a lot of it.", "Everyone needs to edit their writing -- even the most experienced writers. Most times, our first drafts aren't all that great. So take the time you need to shape up your post. Fix typos, run-on sentences, and accidental its/it's mistakes. Make sure your story flows just as well as it did in your outline.", "To help you remember all the little things to check before publishing, ", ".", "I hate to break it to you, but ", " ", " ", "Ever.", "There will ", " be more things you can do to make your posts better. More images. Better phrasing. Wittier jokes. The best writers I know, know when to stop obsessing and just hit \"publish.\"", " at which there are diminishing returns for getting closer to \"perfect\" -- and you're really never going to reach \"perfect\" anyway. So while you don't want to publish a post filled with factual inaccuracies and grammatical errors, it's not the end of the world if a typo slips through. It most likely won't affect how many views and leads it brings in.", "Plus, if you (or your readers) find the mistake, all of you have to do is update the post. No biggie. So give yourself a break once and a while -- perfect is the enemy of done.", "By now, you've probably heard that ", ", the more traffic you'll get to your website -- and the more subscribers and leads you'll generate from your posts. But as important as volume is, it's actually more important that you're blogging ", " when you're just getting started. If you publish five posts in one week and then only one or two in the next few weeks, it'll be hard to form a consistent habit. And inconsistency could really confuse your subscribers.", "Instead, it's the companies that make a commitment to regularly publishing quality content to their blogs that tend to reap the biggest rewards in terms of website traffic and leads -- and those results continue to pay out over time.", "To help establish consistency, you'll need a more concrete planning strategy.", "Use it to get into the habit of planning your blog post topics ahead of time, publishing consistently, and even scheduling posts in advance if you're finding yourself having a particularly productive week.", "Here at HubSpot, we typically use good ol' Google Calendar as our blog editorial calendar, which ", ". Or, you can ", " for Excel, Google Sheets, and Google Calendar, along with instructions on how to set them up.", "Both beginner bloggers and advanced bloggers are guilty of this blogging mistake. If you concentrate your analysis on immediate traffic (traffic from email subscribers, RSS feeds, and social shares), then it's going to be hard to prove the enduring value of your blog. After all, the half-life for those sources is very brief -- usually a day or two.", "When marketers who are just starting their business blogs see that their blog posts aren't generating any new traffic after a few days, many of them get frustrated. They think their blog is failing, and they ", ".", "Instead of focusing on the sudden decay of short-term traffic, focus instead on the cumulative potential of organic traffic. Over time, given ", "time, the traffic from day three and beyond of a single blog post will eclipse that big spike on days one and two ", ". You just have to give it a while.", "To help drive this long-term traffic, make sure you're writing blog posts that have durable relevance on a consistent basis. These posts ", ": They're relevant year after year with little or no upkeep, valuable, and high quality.", "Over time, as you write more evergreen content and build search authority, those posts ", ". It all starts with a slight shift in perspective from daily traffic to cumulative traffic so you can reframe the way you view your blog and its ROI entirely.", "Once you start blogging, it's easy to forget that blogging isn't just about getting ", " visitors to your blog. One of ", " is that it helps you steadily grow an email list of subscribers you can share your new content with. Each time you publish a new blog post, your subscribers will give you that initial surge of traffic -- which, in turn, will propel those posts' long-term success.", "The key to getting significant business results (traffic, leads, and eventually customers) ", ".", "First, use your email marketing tool to set up a welcome email for new subscribers, as well as a regular email that pulls in your most recent blog posts. (HubSpot customers: You can ", ", as well as ", ".)", "Next, add subscription CTAs to your blog (and elsewhere, like the footer of your website) to make it easy for people to opt in. These CTAs should be simple, one-field ", " near the top of your blog, above the fold. As for ", ", we typically place our blog CTAs at the bottom of our blog posts or add a slide-in, which you can ", ".", "You can also ", " that you can direct people to via other channels such as social media, other pages on your website, PPC, or email. (For a list of more simple ways to attract subscribers, ", "; for more advanced ideas, ", ".)", "Don't worry if you read through this list and are now thinking to yourself, ", "Remember: I used the word \"common\" to describe these mistakes for a reason. The more you blog, the better you'll get at it -- and you'll reap the benefits in terms of traffic and leads in the process.", "We hope you'll use this list of mistakes as fuel for the fire to step up your blogging game. After all, the ", " will be well worth the time and effort."]}
]